Podkova/src/Documents/ПоручениеЭкспедитору/ПоручениеЭкспедитору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоручениеЭкспедитору</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <basedOn>Catalog.Склады</basedOn>
  <basedOn>Catalog.СтруктураПредприятия</basedOn>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пункт</name>
    <type>
      <types>DefinedType.ОтправительПолучательДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <types>DocumentRef</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуВПункте</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВРаспоряжении</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/ПоручениеЭкспедитору/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Для Каждого Основание Из ДанныеЗаполнения Цикл
			Если ОбщегоНазначения.ЭтоДокумент(Основание.Метаданные()) Тогда
				НоваяСтрока = Основания.Добавить();
				НоваяСтрока.Основание = Основание;
			КонецЕсли;
		КонецЦикла;
		
		Если Основания.Количество() > 0 Тогда
			
			ДанныеОснований = Документы.ПоручениеЭкспедитору.ДанныеОснований(Основания.ВыгрузитьКолонку("Основание"));
			
			Если ДанныеОснований.Пункты.Количество() > 0 Тогда
				Пункт = ДанныеОснований.Пункты[0];
			КонецЕсли;
			Если ДанныеОснований.Склады.Количество() > 0 Тогда
				Склад = ДанныеОснований.Склады[0];
			Иначе
				Склад = Справочники.Склады.СкладПоУмолчанию();
			КонецЕсли;
			Если ДанныеОснований.Контакты.Количество() > 0 Тогда
				КонтактноеЛицо = ДанныеОснований.Контакты[0];
			КонецЕсли;
			Если ДанныеОснований.СпособыДоставки.Количество() = 1 Тогда
				СпособДоставки = ДанныеОснований.СпособыДоставки[0];
			КонецЕсли;
			
			Возврат;
		ИначеЕсли ДанныеЗаполнения.Количество() = 1 Тогда
			ДанныеЗаполнения = ДанныеЗаполнения[0];
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ЭтоГруппа") Тогда
			ВызватьИсключение НСтр("ru = 'Не предусмотрен ввод поручения экспедитору на основании группы складов.'");
		Иначе
			Пункт = ДанныеЗаполнения;
			Склад = ДанныеЗаполнения;
			СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Партнеры")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		Пункт = ДанныеЗаполнения;
		СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пункт)
		И Не ЗначениеЗаполнено(КонтактноеЛицо)
		И ТипЗнч(Пункт) = Тип("СправочникСсылка.Партнеры") Тогда
		ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Пункт, КонтактноеЛицо);
	КонецЕсли;		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверямыхРеквизитов = Новый Массив;
	Если СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте Тогда
		МассивНепроверямыхРеквизитов.Добавить("Склад");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверямыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте Тогда
		Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВыполнения) Тогда
		ДатаВыполнения = Дата;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
